# -*- coding: utf-8 -*-


import numpy as np
import networkx as nx
import re
from indicnlp.tokenize import sentence_tokenize
from sklearn.metrics.pairwise import cosine_similarity
import fasttext
import fasttext.util
import pandas as pd
import pdb
fasttext.util.download_model('hi', if_exists='ignore')

# Function for text preprocessing
def preprocess_text(text):
    # Remove punctuations
    text = re.sub(r'(?<=\d)\.|(?<=\S)\.(?=\S)|,|‘|’|\n|:|;|\"|\'|\(|\)|\{|\}|/|\\|\[|\]|-|_|\+|=|\*|&|^|%|\$|#|@|~|`|\|', '', text)
    orig_sentences = sentence_tokenize.sentence_split(text, lang='hi')
    # words = re.split(r'(\s+|\u0964|\.|\?|\!)', text)
    sentences = []
    for sentence in orig_sentences:
        words  = re.split(r'\s+|(?<=[\u0900-\u097F])(?=[?.!])|(?<=[?.!])(?=[\u0900-\u097F])', sentence)
        words = [word for word in words if word not in stop_words and word.strip() != '']
        clean_sent = ''.join(word if word in ['.', '?', '!'] else word + ' ' for word in words).strip()
        sentences.append(clean_sent)

    return sentences, orig_sentences

def sentence_embedding(sentence, model):
    words = sentence.split()
    embeddings = [model.get_word_vector(word) for word in words if word not in ['.', '\u0964', '?', '!']]
    if embeddings:
        return np.mean(embeddings, axis = 0)
    else:
        return np.zeros(model.get_dimension())

# # Function to create vectors for sentences
def sentence_vectors(sentences):
    sentence_vectors = [sentence_embedding(sentence, fasttext_model) for sentence in sentences]
    # print(sentence_vectors)
    # pdb.set_trace()
    return sentence_vectors

# Function to create the similarity matrix
def build_similarity_matrix(sentences):
    similarity_matrix = np.zeros((len(sentences), len(sentences)))
  
    sent_vectors = sentence_vectors(sentences)
    for i in range(len(sentences)):
        for j in range(len(sentences)):
            if i != j:
                similarity_matrix[i][j] = cosine_similarity(sent_vectors[i].reshape(1,300), sent_vectors[j].reshape(1,300))[0,0]
    # pdb.set_trace()print
    return similarity_matrix

# Function to generate summary using TextRank
def generate_summary(text, top_n=5):
    sentences, orig_sentences = preprocess_text(text)
    similarity_matrix = build_similarity_matrix(sentences)
    nx_graph = nx.from_numpy_array(similarity_matrix)
    scores = nx.pagerank(nx_graph)
    try:
        ranked_sentences = sorted(((scores[i],s) for i,s in enumerate(orig_sentences)), reverse=True)
        summary = " ".join([ranked_sentences[i][1] for i in range(min(len(sentences), top_n))])
    except:
        # print(text)
        print("Length")
        print(len(sentences))
        # print(sentences)
        # # print(len(ranked_sentences))
        # # print(ranked_sentences)
        print(len(orig_sentences))
        # print(orig_sentences)
        # pdb.set_trace()

    return summary

# Example usage
# hindi_text = "और वो भी न तो 'बराक' की वजह से और न ही उनकी वजह से जिनके साथ वो 'मन की बात' करके लौटे हैं. इसके पीछे सीधा हाथ है भारतीय हिंदू मां-बाप से पैदा हुए लुइज़ियाना के गवर्नर बॉबी जिंदल का, जो पैदा हुए थे पियूष जिंदल, लेकिन हाई स्कूल तक पहुंचते-पहुंचते उन्होंने अपना धर्म बदला और हो गए बॉबी जिंदल. बेचारे मां-बाप अभी भी हिंदू ही हैं. ये सब तो ठीक है, इसमें भारत के अच्छे दिन कहां से आ गए? बस एक इजाद की वजह से और वो है फ़ेयर एंड हैंडसम! भारतीय अमरीका या अमरीकी जिंदल साहब को सही मायने में ख़ुद को अमरीकी कहलाने की ऐसी ख़्वाहिश है कि उनकी एक पेंटिंग में उन्हें बिल्कुल गोरा और वो भी बिल्कुल वैसा, जिसे हम गोरा-गोरा कहते हैं न, वैसा दिखाया गया है. समाप्त इश्तहारों की मानें तो 'त्वचा में दूध जैसी गोराई' तो फ़ेयर एंड हैंडसम से ही लाई जा सकती है. तो नज़र रखिएगा, आपके पड़ोस की दुकान से फ़ेयर एंड हैंडसम ग़ायब होने को है क्योंकि उसकी खेप की खेप अब लुइज़ियाना पहुंचेगी और भारत में डॉलरों की बरसात होगी. फ़ेयर एंड हैंडसम के शेयर आसमान चूमेंगे. क्योंकि तस्वीर के जैसा दिखने के लिए जिंदल साहब फ़ेयर एंड हैंडसम का ही तो सहारा लेंगे. तो 'मेक इन इंडिया फ़ॉर लुइज़ियाना' का राग अलापना शुरू कीजिए और प्लीज़, लुइज़ियाना को लुधियाना मत लिख दीजिएगा, जिंदल साहब की शान में गुस्ताख़ी कर देंगे आप. ख़ैर, जब उनकी ये बिल्कुल गुलाबी गोराई वाली पेंटिंग सोशल मीडिया पर आई तो किम कारदाशियां का इंटरनेट का रिकॉर्ड टूटने को आया. अब लोग तो ज़ाहिर हैं, जिंदल साहब के दिल की बात समझे बग़ैर मज़ाक़ उड़ाने लगे सोशल मीडिया पर. उनकी पब्लिसिटी टीम ने कहा कि ये उन्होंने ख़ुद नहीं बनवाया है, किसी चाहनेवाले ने बना कर दिया है. और फिर एक नई पेंटिंग जारी की गई जिसमें उनका रंग ऐसा लग रहा है जैसे कोई गोरा इंसान थोड़ी सी धूप खाकर लौटा हो. राष्ट्रपति पद की उम्मीदवारी दरअसल, जिंदल साहब इस बार रिपब्लिकन पार्टी की तरफ़ से राष्ट्रपति पद की उम्मीदवारी की रेस में शामिल हैं. लेकिन इसके पहले कि आप देसी टीवी चैनल्स की तरह चीख़ना शुरू कर दें कि 'एक इंडियन अब व्हाइट हाउस की रेस में', मैं आपकी उम्मीदों पर इस ठंडे मौसम में ठंडा पानी डाल देता हूं. क्योंकि जिंदल साहब चीख़-चीख़ कर ये भी एलान कर रहे हैं कि उन्हें इंडियन-अमरीकन नहीं कहा जाए, सिर्फ़ अमरीकन कहा जाए. उनके राज्य की एक भारतीय मूल की महिला ने मुझे बताया था कि गवर्नर होने के बावजूद वो होली, दिवाली, ईद, मुहर्रम किसी मौक़े पर देसियों के आस-पास नहीं दिखना पसंद करते. और तो और उन्होंने मुसलमानों के ख़िलाफ़ ऐसी जिहाद छेड़ी है कि प्रवीण तोगड़िया भी शर्मा जाएंगे. पहले तो उन्होंने कहा कि यूरोप में कई ऐसे इलाक़े हैं जिनपर मुसलमानों ने क़ब्ज़ा कर लिया है और वहां शरिया क़ानून चलता है और अमरीका में भी वही हाल होनेवाला है. मुसलमान घुल-मिल कर नहीं रहते, क्योंकि उनका एजेंडा है ख़ामोशी से अमरीका को इस्लामी मुल्क बनाना. सबका साथ, सबका विकास इस बात का कोई सबूत नहीं पेश कर पाए तो क्या हुआ, जिस कट्टरपंथी इसाई तबक़े को लुभाने की कोशिश कर रहे हैं वो वहां हीरो तो बन गए. इन दिनों ऐसी संस्थाओं के इर्द-गिर्द नज़र आ रहे हैं वो जिनका नारा है कि जो अमरीका आए वो इसाई बन जाए तभी सही मायने में वो अमरीकी कहलाएगा. वैसे मुझे समझ में ये बात नहीं आ रही कि जिंदल साहब किसकी सलाह पर चल रहे हैं. अपने क्लास के टॉपर थे, रोड्स स्कॉलर हैं और कुछ साल पहले तक उन्हें रिपब्लिकन पार्टी के ओबामा की तरह देखा जा रहा था. थोड़ा सा हिसाब-किताब लगाते तो नज़र आ जाता कि अमरीका में सिर्फ़ एक तबक़े के वोट से सदर बनना तो दूर की बात अपनी पार्टी की उम्मीदवारी मिलने की भी उम्मीद नहीं की जा सकती. अमरीका में बात नहीं समझ में आ रही हो तो भारत में ही देख लेते. गुजरात के मोदीजी और दिल्ली के मोदीजी में जो फ़र्क़ है, उसकी बारीकी ज़रा समझ लें तो बस चांदी ही चांदी है. छोटा सा मंत्र है 'सबका साथ, सबका विकास' दिन भर रटिए और फिर वोट बटोरिए. (बीबीसी हिन्दी के एंड्रॉएड ऐप के लिए यहां क्लिक करें. आप हमें फ़ेसबुक और ट्विटर पर भी फ़ॉलो कर सकते हैं.)"
# 'उत्तर भारत शीत लहर जारी पहाड़ी क्षेत्रों पारा सामान्य डिग्री कोहरे वजह 45 ट्रेनें रद्द गईं कम कम 14 ट्रेने देरी चल रही । राष्ट्रीय राजधानी आज सर्दी रही न्यूनतम तापमान 11.4 डिग्री सेल्सियस रिकॉर्ड सामान्य चार डिग्री ज्यादा जबकि अधिकतम पारा मौसम औसत तापमान तीन डिग्री ऊपर रहते 17.2 डिग्री सेल्सियस रिकॉर्ड । सुबह वक्त हल्का कोहरा वजह 45 ट्रेनों रद्द पड़ा 14 अन्य देरी चलीं । आईजीआई प्रवक्ता बताया उड़ानों संचालन ठीक । हिमाचल प्रदेश पारा सामान्य चार डिग्री बना । हालांकि क्षेत्र सुबह वक्त आसमान साफ दिन चढ़ने आसमान आंशिक रूप बादल छा गए मध्य तथा ऊंची पहाड़ियों तेज बर्फीली हवांए चलने लगीं । राज्य सर्द इलाका केलांग न्यूनतम तापमान शून्य 4.6 डिग्री सेल्सियस कम रिकॉर्ड जबकि मनाली काल्पा न्यूनतम तापमान क्रमश शून्य 2.6 डिग्री शून्य 1.0 डिग्री सेल्सियस कम दर्ज । कश्मीर घाटी लद्दाख क्षेत्र शीत लहर प्रचंड गई समूचे मंडल पारा गिरा वजह शुष्क मौसम बना । लेह शहर पारा सात डिग्री सेल्सियस गिरा राज्य सर्द इलाका । टिप्पणियां करगिल शहर न्यूनतम तापमान शून्य 13.8 डिग्री सेल्सियस दर्ज जबकि श्रीनगर शून्य चार डिग्री कम रिकॉर्ड । उधर पंजाब हरियाणा न्यूनतम तापमान सामान्य डिग्री ज्यादा बना । नारनौल दोनों राज्यों ठंडा क्षेत्र न्यूनतम तापमान चार डिग्री सेल्सियस रिकॉर्ड । राजस्थान हिस्सों शीत लहर असर जारी चुरू राज्य ठंडा इलाका । तापमान 3.9 डिग्री दर्ज । राष्ट्रीय राजधानी आज सर्दी रही न्यूनतम तापमान 11.4 डिग्री सेल्सियस रिकॉर्ड सामान्य चार डिग्री ज्यादा जबकि अधिकतम पारा मौसम औसत तापमान तीन डिग्री ऊपर रहते 17.2 डिग्री सेल्सियस रिकॉर्ड । सुबह वक्त हल्का कोहरा वजह 45 ट्रेनों रद्द पड़ा 14 अन्य देरी चलीं । आईजीआई प्रवक्ता बताया उड़ानों संचालन ठीक । हिमाचल प्रदेश पारा सामान्य चार डिग्री बना । हालांकि क्षेत्र सुबह वक्त आसमान साफ दिन चढ़ने आसमान आंशिक रूप बादल छा गए मध्य तथा ऊंची पहाड़ियों तेज बर्फीली हवांए चलने लगीं । राज्य सर्द इलाका केलांग न्यूनतम तापमान शून्य 4.6 डिग्री सेल्सियस कम रिकॉर्ड जबकि मनाली काल्पा न्यूनतम तापमान क्रमश शून्य 2.6 डिग्री शून्य 1.0 डिग्री सेल्सियस कम दर्ज । कश्मीर घाटी लद्दाख क्षेत्र शीत लहर प्रचंड गई समूचे मंडल पारा गिरा वजह शुष्क मौसम बना । लेह शहर पारा सात डिग्री सेल्सियस गिरा राज्य सर्द इलाका । टिप्पणियां करगिल शहर न्यूनतम तापमान शून्य 13.8 डिग्री सेल्सियस दर्ज जबकि श्रीनगर शून्य चार डिग्री कम रिकॉर्ड । उधर पंजाब हरियाणा न्यूनतम तापमान सामान्य डिग्री ज्यादा बना । नारनौल दोनों राज्यों ठंडा क्षेत्र न्यूनतम तापमान चार डिग्री सेल्सियस रिकॉर्ड । राजस्थान हिस्सों शीत लहर असर जारी चुरू राज्य ठंडा इलाका । तापमान 3.9 डिग्री दर्ज । आईजीआई प्रवक्ता बताया उड़ानों संचालन ठीक । हिमाचल प्रदेश पारा सामान्य चार डिग्री बना । हालांकि क्षेत्र सुबह वक्त आसमान साफ दिन चढ़ने आसमान आंशिक रूप बादल छा गए मध्य तथा ऊंची पहाड़ियों तेज बर्फीली हवांए चलने लगीं । राज्य सर्द इलाका केलांग न्यूनतम तापमान शून्य 4.6 डिग्री सेल्सियस कम रिकॉर्ड जबकि मनाली काल्पा न्यूनतम तापमान क्रमश शून्य 2.6 डिग्री शून्य 1.0 डिग्री सेल्सियस कम दर्ज । कश्मीर घाटी लद्दाख क्षेत्र शीत लहर प्रचंड गई समूचे मंडल पारा गिरा वजह शुष्क मौसम बना । लेह शहर पारा सात डिग्री सेल्सियस गिरा राज्य सर्द इलाका । टिप्पणियां करगिल शहर न्यूनतम तापमान शून्य 13.8 डिग्री सेल्सियस दर्ज जबकि श्रीनगर शून्य चार डिग्री कम रिकॉर्ड । उधर पंजाब हरियाणा न्यूनतम तापमान सामान्य डिग्री ज्यादा बना । नारनौल दोनों राज्यों ठंडा क्षेत्र न्यूनतम तापमान चार डिग्री सेल्सियस रिकॉर्ड । राजस्थान हिस्सों शीत लहर असर जारी चुरू राज्य ठंडा इलाका । तापमान 3.9 डिग्री दर्ज । हिमाचल प्रदेश पारा सामान्य चार डिग्री बना । हालांकि क्षेत्र सुबह वक्त आसमान साफ दिन चढ़ने आसमान आंशिक रूप बादल छा गए मध्य तथा ऊंची पहाड़ियों तेज बर्फीली हवांए चलने लगीं । राज्य सर्द इलाका केलांग न्यूनतम तापमान शून्य 4.6 डिग्री सेल्सियस कम रिकॉर्ड जबकि मनाली काल्पा न्यूनतम तापमान क्रमश शून्य 2.6 डिग्री शून्य 1.0 डिग्री सेल्सियस कम दर्ज । कश्मीर घाटी लद्दाख क्षेत्र शीत लहर प्रचंड गई समूचे मंडल पारा गिरा वजह शुष्क मौसम बना । लेह शहर पारा सात डिग्री सेल्सियस गिरा राज्य सर्द इलाका । टिप्पणियां करगिल शहर न्यूनतम तापमान शून्य 13.8 डिग्री सेल्सियस दर्ज जबकि श्रीनगर शून्य चार डिग्री कम रिकॉर्ड । उधर पंजाब हरियाणा न्यूनतम तापमान सामान्य डिग्री ज्यादा बना । नारनौल दोनों राज्यों ठंडा क्षेत्र न्यूनतम तापमान चार डिग्री सेल्सियस रिकॉर्ड । राजस्थान हिस्सों शीत लहर असर जारी चुरू राज्य ठंडा इलाका । तापमान 3.9 डिग्री दर्ज । राज्य सर्द इलाका केलांग न्यूनतम तापमान शून्य 4.6 डिग्री सेल्सियस कम रिकॉर्ड जबकि मनाली काल्पा न्यूनतम तापमान क्रमश शून्य 2.6 डिग्री शून्य 1.0 डिग्री सेल्सियस कम दर्ज । कश्मीर घाटी लद्दाख क्षेत्र शीत लहर प्रचंड गई समूचे मंडल पारा गिरा वजह शुष्क मौसम बना । लेह शहर पारा सात डिग्री सेल्सियस गिरा राज्य सर्द इलाका । टिप्पणियां करगिल शहर न्यूनतम तापमान शून्य 13.8 डिग्री सेल्सियस दर्ज जबकि श्रीनगर शून्य चार डिग्री कम रिकॉर्ड । उधर पंजाब हरियाणा न्यूनतम तापमान सामान्य डिग्री ज्यादा बना । नारनौल दोनों राज्यों ठंडा क्षेत्र न्यूनतम तापमान चार डिग्री सेल्सियस रिकॉर्ड । राजस्थान हिस्सों शीत लहर असर जारी चुरू राज्य ठंडा इलाका । तापमान 3.9 डिग्री दर्ज । कश्मीर घाटी लद्दाख क्षेत्र शीत लहर प्रचंड गई समूचे मंडल पारा गिरा वजह शुष्क मौसम बना । लेह शहर पारा सात डिग्री सेल्सियस गिरा राज्य सर्द इलाका । टिप्पणियां करगिल शहर न्यूनतम तापमान शून्य 13.8 डिग्री सेल्सियस दर्ज जबकि श्रीनगर शून्य चार डिग्री कम रिकॉर्ड । उधर पंजाब हरियाणा न्यूनतम तापमान सामान्य डिग्री ज्यादा बना । नारनौल दोनों राज्यों ठंडा क्षेत्र न्यूनतम तापमान चार डिग्री सेल्सियस रिकॉर्ड । राजस्थान हिस्सों शीत लहर असर जारी चुरू राज्य ठंडा इलाका । तापमान 3.9 डिग्री दर्ज । करगिल शहर न्यूनतम तापमान शून्य 13.8 डिग्री सेल्सियस दर्ज जबकि श्रीनगर शून्य चार डिग्री कम रिकॉर्ड । उधर पंजाब हरियाणा न्यूनतम तापमान सामान्य डिग्री ज्यादा बना । नारनौल दोनों राज्यों ठंडा क्षेत्र न्यूनतम तापमान चार डिग्री सेल्सियस रिकॉर्ड । राजस्थान हिस्सों शीत लहर असर जारी चुरू राज्य ठंडा इलाका । तापमान 3.9 डिग्री दर्ज । राजस्थान हिस्सों शीत लहर असर जारी चुरू राज्य ठंडा इलाका । तापमान 3.9 डिग्री दर्ज ।'
# df = pd.read_json("../Datasets/Hindi_summarization/XLSum/hindi_train.jsonl", lines = True)
df = pd.read_csv("Extractive_summ.csv")
summaries = []

with open('stopwords-hi.txt', 'r', encoding='utf-8') as file:
    stop_words = set(file.read().split())
model_path = 'cc.hi.300.bin'
fasttext_model = fasttext.load_model(model_path)

# hindi_text = "1. वेनेज़ुएला: 1 रुपए 36 पैसे 2. सऊदी अरब: 15 रुपए 59 पैसे 3. ईरान: 21 रुपए 68 पैसे 4. अमरीकाः 39 रुपए 40 पैसे समाप्त 5. पाकिस्तान: 49 रुपए 47 पैसे 6. भारतः 59 रुपए 99 पैसे (दिल्ली) 65 रुपए 59 पैसे (लखनऊ) 7. नेपाल: 58 रुपए 95 पैसे 8. श्रीलंका: 60 रुपए 31 पैसे 9. चीनः 60 रुपए 99 पैसे 10. बांग्लादेश: 80 रुपए 64 पैसे 11. ब्रिटेनः 98 रुपए 26 पैसे 12. हांगकांग: 121 रुपए 97 पैसे (एक डॉलर: 67.76 रुपए) (सौजन्य: www.globalpetrolprice.com) (बीबीसी हिंदी के एंड्रॉएड ऐप के लिए आप यहां क्लिक कर सकते हैं. आप हमें फ़ेसबुक और ट्विटर पर फ़ॉलो भी कर सकते हैं.)"
# summary = generate_summary(hindi_text)
print(len(df['Article']))
for i, article in enumerate(df['Article']):
    if i%100 == 0:
        print(i)
    try:
        summary = generate_summary(article)
    except:
        print(i)
        pdb.set_trace()
    summaries.append(summary)

dict = {'summary_gen': summaries}
df2 = pd.DataFrame(dict)

df2.to_csv("extr_summ.csv", index=False)
